Gloryfy/NFC/NfcdlibEx1_BasicDiscLoop_s32k118/src/phApp_Init.c
    if (pHal->wFirmwareVer < 0x308)
    {
        /* With Ncx3330 FW version < 3.8, static UID is supported by default. */
        aCmd[0] = 0x00;
    }
    /* Enabling the Random UID in 5180 EEPROM */
    wStatus = phhalHw_Ncx3330_Instr_WriteE2Prom(
        (phhalHw_Ncx3330_DataParams_t *) pHal,
        0x58,
        aCmd,
        0x01
        );

    CHECK_SUCCESS(wStatus);
#endif

#if defined(NXPBUILD__PHHAL_HW_PN7462AU) && defined(NXPBUILD__PHHAL_HW_TARGET)
    /* Set Listen Parameters in HAL Buffer used during Autocoll */
    wStatus = phhalHw_PN7462AU_SetListenParam(
       pHal,
       &sens_res[0],
       &nfc_id1[0],
       sel_res,
       (poll_res[0] == 0x02 ? PH_ON : PH_OFF),
       &poll_res[2],
       &poll_res[8],
       bSystemCode);
    CHECK_SUCCESS(wStatus);
#endif

    return PH_ERR_SUCCESS;
}

phStatus_t phApp_Configure_IRQ()
{
#ifdef PH_OSAL_LINUX
    phStatus_t  wStatus;
#endif /* PH_OSAL_LINUX */

#ifdef PH_PLATFORM_HAS_ICFRONTEND
    phDriver_Pin_Config_t pinCfg;

    pinCfg.bOutputLogic = PH_DRIVER_SET_LOW;
    pinCfg.bPullSelect = PHDRIVER_PIN_IRQ_PULL_CFG;

    pinCfg.eInterruptConfig = PIN_IRQ_TRIGGER_TYPE;
    phDriver_PinConfig(PHDRIVER_PIN_IRQ, PH_DRIVER_PINFUNC_INTERRUPT, &pinCfg);

#ifdef PHDRIVER_LPC1769
    NVIC_SetPriority(EINT_IRQn, EINT_PRIORITY);
    /* Enable interrupt in the NVIC */
    NVIC_ClearPendingIRQ(EINT_IRQn);
    NVIC_EnableIRQ(EINT_IRQn);
#endif /* PHDRIVER_LPC1769 */

#ifdef PH_OSAL_LINUX

    gphPiThreadObj.pTaskName = (uint8_t *) "IrqPolling";
    gphPiThreadObj.pStackBuffer = NULL;
    gphPiThreadObj.priority = PI_IRQ_POLLING_TASK_PRIO;
    gphPiThreadObj.stackSizeInNum = PI_IRQ_POLLING_TASK_STACK;
    PH_CHECK_SUCCESS_FCT(wStatus, phOsal_ThreadCreate(&gphPiThreadObj.ThreadHandle, &gphPiThreadObj,
        &phExample_IrqPolling, NULL));

#endif /* PH_OSAL_LINUX */

#ifdef PHDRIVER_KINETIS_K82
    NVIC_SetPriority(EINT_IRQn, EINT_PRIORITY);
    NVIC_ClearPendingIRQ(EINT_IRQn);
    EnableIRQ(EINT_IRQn);
#endif /* PHDRIVER_KINETIS_K82 */

#ifdef PHDRIVER_S32K14x
    INT_SYS_SetPriority(EINT_IRQn, EINT_PRIORITY);
    INT_SYS_ClearPending(EINT_IRQn);
    INT_SYS_EnableIRQ(EINT_IRQn);
#endif

#ifdef PHDRIVER_S32K116
    /* Install EINT interrupt handler */
    INT_SYS_InstallHandler(EINT_IRQn, &CLIF_IRQHandler, (isr_t *)0);
    INT_SYS_SetPriority(EINT_IRQn, EINT_PRIORITY);
    INT_SYS_ClearPending(EINT_IRQn);
    INT_SYS_EnableIRQ(EINT_IRQn);
#endif
#endif /* #ifdef PH_PLATFORM_HAS_ICFRONTEND */

    return PH_ERR_SUCCESS;
}

phStatus_t phApp_Configure_LED(uint8_t led, uint8_t state)
{
	uint32_t pin_number = 0;
	uint8_t pin_state   = 0;

	switch(led)
	{
	case 0:
		pin_number = PHDRIVER_PIN_LED_RED;
		break;
	case 1:
		pin_number = PHDRIVER_PIN_LED_GREEN;
		break;
	default:
		break;
	}

	if(state != 0)
	{
		pin_state = RESET_POWERUP_LEVEL;
	}
	else
	{
		pin_state = RESET_POWERDOWN_LEVEL;
	}

    phDriver_PinWrite(pin_number, pin_state);

    return PH_ERR_SUCCESS;
}


#ifdef PH_OSAL_LINUX
/*
 * \brief: The purpose of this Thread is to detect RF signal from an External Peer .
 */
static void phExample_IrqPolling(void* param)
{
    uint8_t bgpioVal = 0;
    uint8_t bhighOrLow = 0;

    if(PIN_IRQ_TRIGGER_TYPE ==  PH_DRIVER_INTERRUPT_RISINGEDGE)
    {
        bhighOrLow = 1;
    }

    while(PiGpio_read(PHDRIVER_PIN_IRQ, &bgpioVal) != PH_ERR_SUCCESS)
    {
        PiGpio_unexport(PHDRIVER_PIN_IRQ);
        PiGpio_export(PHDRIVER_PIN_IRQ);
        PiGpio_set_direction(PHDRIVER_PIN_IRQ, false);

        if(PIN_IRQ_TRIGGER_TYPE ==  PH_DRIVER_INTERRUPT_RISINGEDGE)
        {
            PiGpio_set_edge(PHDRIVER_PIN_IRQ, true, false);
        }
        else
        {
            PiGpio_set_edge(PHDRIVER_PIN_IRQ, false, true);
        }
    }

    /* Initial status: If pin is already Active, post an event. */
    if(bgpioVal == bhighOrLow)
    {
        CLIF_IRQHandler();
    }

    while(1)
    {
        /* Block forever for Raising Edge in PHDRIVER_PIN_IRQ. */
        if(PiGpio_poll(PHDRIVER_PIN_IRQ, bhighOrLow, -1) == PH_ERR_SUCCESS)
        {
            CLIF_IRQHandler();
        }
        else
        {
            PiGpio_unexport(PHDRIVER_PIN_IRQ);

            PiGpio_export(PHDRIVER_PIN_IRQ);

            PiGpio_set_direction(PHDRIVER_PIN_IRQ, false);

            if(PIN_IRQ_TRIGGER_TYPE ==  PH_DRIVER_INTERRUPT_RISINGEDGE)
            {
                PiGpio_set_edge(PHDRIVER_PIN_IRQ, true, false);
            }
            else
            {
                PiGpio_set_edge(PHDRIVER_PIN_IRQ, false, true);
            }
        }


    }
}
#endif /* PH_OSAL_LINUX */


#ifdef PH_PLATFORM_HAS_ICFRONTEND
void CLIF_IRQHandler(void)
{
    /* Read the interrupt status of external interrupt attached to the reader IC IRQ pin */
    if (phDriver_PinRead(PHDRIVER_PIN_IRQ, PH_DRIVER_PINFUNC_INTERRUPT))
    {
        /* Call application registered callback. */
        if (pHal->pRFISRCallback != NULL)
        {
            pHal->pRFISRCallback(pHal);
        }
    }
    phDriver_PinClearIntStatus(PHDRIVER_PIN_IRQ);
}
#endif /* PH_PLATFORM_HAS_ICFRONTEND */


#ifdef NXPBUILD__PHHAL_HW_NCx3320
/* Configure LPCD (for NCx3320) */
phStatus_t phApp_ConfigureLPCD(void)
{
    phStatus_t status;
    uint8_t bValueI;
    uint8_t bValueQ;

    /* Configure LPCD calibration standby time (T4) and RF ON time (T3). */
    status = phhalHw_Ncx3320_Cmd_Lpcd_SetConfig(
        pHal,
        PHHAL_HW_NCx3320_CMD_LPCD_MODE_DEFAULT,
        0,
        0,
        PH_NFCRDLIB_EXAMPLE_LPCD_GUARDTIME,
        PH_NFCRDLIB_EXAMPLE_LPCD_RFON_TIME);

    /* Perform LPCD calibration to get I and Q values. */
	do {
		status = phhalHw_Ncx3320_Cmd_Lpcd_GetConfig(pHal, &bValueI, &bValueQ);
	} while (status == PH_STATUS_INPROCESS);
	CHECK_SUCCESS(status);

	//DEBUG_PRINTF("[User Log]bValueI: %d, bValueQ: %d\r\n",bValueI,bValueQ);

    /* Configure I and Q values for LPCD detection cycle. */
    status = phhalHw_Ncx3320_Cmd_Lpcd_SetConfig(
        pHal,
        PHHAL_HW_NCx3320_CMD_LPCD_MODE_POWERDOWN,
        bValueI,
        bValueQ,
        PH_NFCRDLIB_EXAMPLE_LPCD_GUARDTIME,
        PH_NFCRDLIB_EXAMPLE_LPCD_RFON_TIME);

